# 内部資材
import main
from main import app

with app.app_context():
    ###########################################################
    # t_polygon参照
    ###########################################################
    poly = main.t_polygon.query.all()
    print("###########################################################")
    print("# t_polygon参照")
    print("###########################################################")
    for p in poly:
        print(
            "id = {}, nm = {}, color = {}, lat = {}, lon = {}".format(
                p.id, p.nm, p.color, p.lat, p.lon
            )
        )
    ###########################################################
    # m_color参照
    ###########################################################
    color = main.m_color.query.all()
    print("###########################################################")
    print("# m_color参照")
    print("###########################################################")
    for c in color:
        print("id = {}, color = {}".format(c.id, c.color))
